In [1]:
import pandas as pd

In [4]:
my_dict = {'name':['ahmad','jack','alisa','chriss'],
          'age':[20,25,24,32],
          'designation':['VP','CEO','CFO','VP']}

df = pd.DataFrame(my_dict)
df

     name  age designation
0   ahmad   20          VP
1    jack   25         CEO
2   alisa   24         CFO
3  chriss   32          VP

In [5]:
df.to_csv('test_csv')

In [7]:
df_csv = pd.read_csv('test_csv')
df_csv

   Unnamed: 0    name  age designation
0           0   ahmad   20          VP
1           1    jack   25         CEO
2           2   alisa   24         CFO
3           3  chriss   32          VP

In [8]:
df.to_csv('test1_csv', index = False)

In [10]:
df_csv = pd.read_csv('test1_csv')

In [11]:
df_csv

     name  age designation
0   ahmad   20          VP
1    jack   25         CEO
2   alisa   24         CFO
3  chriss   32          VP

In [14]:
df_csv = pd.read_csv('test1_csv', header = 2)

In [15]:
df_csv

     jack  25  CEO
0   alisa  24  CFO
1  chriss  32   VP

In [28]:
df_csv = pd.read_csv('test1_csv', names=['a','b','c'], header= 1)

In [25]:
df_csv

        a    b            c
0    name  age  designation
1   ahmad   20           VP
2    jack   25          CEO
3   alisa   24          CFO
4  chriss   32           VP

In [29]:
df_csv

        a   b    c
0    jack  25  CEO
1   alisa  24  CFO
2  chriss  32   VP

In [32]:
df.to_csv('csv_example', index=False, header = False)

In [37]:
df_csv = pd.read_csv('csv_example',names=['AGE', 'DESIGNATION', 'NAME'])

In [38]:
df_csv

      AGE  DESIGNATION NAME
0   ahmad           20   VP
1    jack           25  CEO
2   alisa           24  CFO
3  chriss           32   VP

In [39]:
df.to_csv('test2_csv',index = False, sep=":")

In [40]:
df_csv = pd.read_csv('test2_csv', sep=":")

In [41]:
df_csv

     name  age designation
0   ahmad   20          VP
1    jack   25         CEO
2   alisa   24         CFO
3  chriss   32          VP

In [42]:
df_csv.set_index('age')

       name designation
age
20    ahmad          VP
25     jack         CEO
24    alisa         CFO
32   chriss          VP

In [57]:
df_csv = pd.read_csv('test2_csv', sep=":",index_col = [0,2])

In [58]:
df_csv

                    age
name   designation
ahmad  VP            20
jack   CEO           25
alisa  CFO           24
chriss VP            32